Show / Hide Table of Contents
Class NumberGroups
Defines used input of groups of numbers.
Inheritance
System.Object
System.Collections.Generic.List<System.Collections.Generic.List<ValueCount>>
NumberGroups
Implements
System.Collections.Generic.IList<System.Collections.Generic.List<ValueCount>>
System.Collections.Generic.ICollection<System.Collections.Generic.List<ValueCount>>
System.Collections.IList
System.Collections.ICollection
System.Collections.Generic.IReadOnlyList<System.Collections.Generic.List<ValueCount>>
System.Collections.Generic.IReadOnlyCollection<System.Collections.Generic.List<ValueCount>>
System.Collections.Generic.IEnumerable<System.Collections.Generic.List<ValueCount>>
System.Collections.IEnumerable
Inherited Members
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.IList.get_Item(System.Int32)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.IList.set_Item(System.Int32, System.Object)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Add(System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.IList.Add(System.Object)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.AddRange(System.Collections.Generic.IEnumerable<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.AsReadOnly()
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.BinarySearch(System.Int32, System.Int32, System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>, System.Collections.Generic.IComparer<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.BinarySearch(System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.BinarySearch(System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>, System.Collections.Generic.IComparer<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Clear()
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Contains(System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.IList.Contains(System.Object)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.ConvertAll<TOutput>(System.Converter<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>, TOutput>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.CopyTo(System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>[])
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.ICollection.CopyTo(System.Array, System.Int32)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.CopyTo(System.Int32, System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>[], System.Int32, System.Int32)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.CopyTo(System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>[], System.Int32)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Exists(System.Predicate<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Find(System.Predicate<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.FindAll(System.Predicate<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.FindIndex(System.Predicate<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.FindIndex(System.Int32, System.Predicate<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.FindIndex(System.Int32, System.Int32, System.Predicate<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.FindLast(System.Predicate<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.FindLastIndex(System.Predicate<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.FindLastIndex(System.Int32, System.Predicate<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.FindLastIndex(System.Int32, System.Int32, System.Predicate<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.ForEach(System.Action<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.GetEnumerator()
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.Generic.IEnumerable<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.GetEnumerator()
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.IEnumerable.GetEnumerator()
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.GetRange(System.Int32, System.Int32)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.IndexOf(System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.IList.IndexOf(System.Object)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.IndexOf(System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>, System.Int32)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.IndexOf(System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>, System.Int32, System.Int32)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Insert(System.Int32, System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.IList.Insert(System.Int32, System.Object)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.InsertRange(System.Int32, System.Collections.Generic.IEnumerable<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.LastIndexOf(System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.LastIndexOf(System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>, System.Int32)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.LastIndexOf(System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>, System.Int32, System.Int32)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Remove(System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.IList.Remove(System.Object)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.RemoveAll(System.Predicate<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.RemoveAt(System.Int32)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.RemoveRange(System.Int32, System.Int32)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Reverse()
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Reverse(System.Int32, System.Int32)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Sort()
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Sort(System.Collections.Generic.IComparer<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Sort(System.Int32, System.Int32, System.Collections.Generic.IComparer<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Sort(System.Comparison<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.ToArray()
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.TrimExcess()
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.TrueForAll(System.Predicate<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>)
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Capacity
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Count
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.IList.IsFixedSize
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.Generic.ICollection<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.IsReadOnly
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.IList.IsReadOnly
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.ICollection.IsSynchronized
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.ICollection.SyncRoot
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.Item[System.Int32]
 System.Collections.Generic.List<System.Collections.Generic.List<IdeaRS.OpenModel.Parameters.ValueCount>>.System.Collections.IList.Item[System.Int32]
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Parameters
Assembly: IdeaRS.OpenModel.dll
Syntax
public sealed class NumberGroups : List<List<ValueCount>>, IList<List<ValueCount>>, ICollection<List<ValueCount>>, IList, ICollection, IReadOnlyList<List<ValueCount>>, IReadOnlyCollection<List<ValueCount>>, IEnumerable<List<ValueCount>>, IEnumerable
Methods
Improve this Doc   View Source
Create(IEnumerable<Double>)
Creates new instance with one group with specified sequence of numbers.
Declaration
public static NumberGroups Create(IEnumerable<double> positions)
Parameters
 Type |  Name |  Description
 System.Collections.Generic.IEnumerable<System.Double> |  positions
The sequence of numbers to add to group.
Returns
 Type |  Description
 NumberGroups
A new instance of group.
Improve this Doc   View Source
Create(List<ValueCount>)
Creates new instance with list of ValueCount .
Declaration
public static NumberGroups Create(List<ValueCount> list)
Parameters
 Type |  Name |  Description
 System.Collections.Generic.List<ValueCount> |  list
The list of ValueCount objects.
Returns
 Type |  Description
 NumberGroups
A new instance of group.
Improve this Doc   View Source
Create(Double)
Creates new instance with one group with one value.
Declaration
public static NumberGroups Create(double value)
Parameters
 Type |  Name |  Description
 System.Double |  value
The value to set to group.
Returns
 Type |  Description
 NumberGroups
A new instance of group.
Improve this Doc   View Source
Create(Double, Int32)
Creates a new instance of one group with several values (defined by count).
Declaration
public static NumberGroups Create(double value, int count)
Parameters
 Type |  Name |  Description
 System.Double |  value
The input value.
 System.Int32 |  count
The count, defined value repeating.
Returns
 Type |  Description
 NumberGroups
A new instance of group.
Improve this Doc   View Source
Create(Double[])
Creates new instance with one group with specified sequence of numbers.
Declaration
public static NumberGroups Create(params double[] positions)
Parameters
 Type |  Name |  Description
 System.Double[] |  positions
The sequence of numbers to add to group.
Returns
 Type |  Description
 NumberGroups
A new instance of group.
Improve this Doc   View Source
Create(String[])
Creates new instance with varibale count of bolts based on * operator
Declaration
public static NumberGroups Create(params string[] positions)
Parameters
 Type |  Name |  Description
 System.String[] |  positions
Returns
 Type |  Description
 NumberGroups
Improve this Doc   View Source
CreateGroups(IEnumerable<Double>)
Creates new instance with groups with with one value in group.
Declaration
public static NumberGroups CreateGroups(IEnumerable<double> positions)
Parameters
 Type |  Name |  Description
 System.Collections.Generic.IEnumerable<System.Double> |  positions
The sequence of numbers to create groups.
Returns
 Type |  Description
 NumberGroups
A new instance of groups.
Improve this Doc   View Source
CreateGroups(Double[])
Creates new instance with groups with with one value in group.
Declaration
public static NumberGroups CreateGroups(params double[] positions)
Parameters
 Type |  Name |  Description
 System.Double[] |  positions
The sequence of numbers to create groups.
Returns
 Type |  Description
 NumberGroups
A new instance of groups.
Implements
 System.Collections.Generic.IList<T>
 System.Collections.Generic.ICollection<T>
 System.Collections.IList
 System.Collections.ICollection
 System.Collections.Generic.IReadOnlyList<T>
 System.Collections.Generic.IReadOnlyCollection<T>
 System.Collections.Generic.IEnumerable<T>
 System.Collections.IEnumerable
 Improve this Doc
 View Source